Tekla Open API Reference for Tekla Structures 2025
Hideable Methods
The Hideable type exposes the following members.
Methods
Name | Description
HideFromDrawing
 Hides this object from the whole drawing. Calling Modify on the object is required to hide the object.
HideFromDrawingView
 Hides this object from the drawing view. Calling Modify on the object is required to hide the object.
ShowInDrawing
 Shows this object in the whole drawing. Calling Modify on the object is required to show the object.
ShowInDrawingView
 Shows this object in the drawing view. Calling Modify on the object is required to show the object.
Top
See Also
Reference
Hideable Class
Tekla.Structures.Drawing Namespace